#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/lhtran/aws_ec2_gatewise/runs/run-tgiTi7rwTRzGXgH2

Waiting for the plan to start...

Terraform v1.3.1
on linux_amd64
Initializing plugins and modules...
data.aws_vpcs.selected: Reading...
data.aws_route53_zone.selected: Reading...
data.aws_ami.gatewise_ami: Reading...
data.aws_ami.gatewise_ami: Read complete after 0s [id=ami-06f2e4ad33302007c]
data.aws_vpcs.selected: Read complete after 0s [id=us-east-1]
data.aws_security_groups.web: Reading...
data.aws_subnets.selected_public: Reading...
data.aws_security_groups.my_ip: Reading...
data.aws_security_groups.default: Reading...
data.aws_security_groups.web: Read complete after 0s [id=us-east-1]
data.aws_subnets.selected_public: Read complete after 0s [id=us-east-1]
data.aws_security_groups.default: Read complete after 0s [id=us-east-1]
data.aws_security_groups.my_ip: Read complete after 0s [id=us-east-1]
module.gatewise_ec2.aws_instance.this[0]: Refreshing state... [id=i-0075702c47720aee9]
data.aws_route53_zone.selected: Read complete after 0s [id=Z022583428QVEZLG6VHU3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route53_record.gatewise will be created
  + resource "aws_route53_record" "gatewise" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "gatewiseb"
      + records         = [
          + "54.152.91.27",
        ]
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z022583428QVEZLG6VHU3"
    }

  # module.gatewise_ec2.aws_instance.this[0] will be updated in-place
  ~ resource "aws_instance" "this" {
        id                                   = "i-0075702c47720aee9"
      ~ tags                                 = {
          ~ "Name" = "awspl-app-gatewise" -> "awspl-app-gatewise-newtestpr"
            # (2 unchanged elements hidden)
        }
      ~ tags_all                             = {
          ~ "Name" = "awspl-app-gatewise" -> "awspl-app-gatewise-newtestpr"
            # (2 unchanged elements hidden)
        }
      ~ volume_tags                          = {
          ~ "Name" = "awspl-app-gatewise" -> "awspl-app-gatewise-newtestpr"
            # (2 unchanged elements hidden)
        }
        # (30 unchanged attributes hidden)

        # (8 unchanged blocks hidden)
    }

Plan: 1 to add, 1 to change, 0 to destroy.


```

</details>

*Pushed by: @longhtran91, Action: `pull_request`*